package pkg;

public enum Address {
    포스코구미("(주)포스코케미칼 양극재 구미공장",128.447419115508,	36.1423320575512),
    //포스코퓨처엠화학("(주)포스코퓨처엠 포항화학사업부",);
    포스코퓨처엠("㈜포스코퓨처엠",129.4161431,36.00156903),
    포스코("㈜포스코",129.38245,35.998765593911),
    포스코퓨처엠광양("㈜포스코퓨처엠 광양화학사업부",127.7501626,34.93541591),
    포스코MC머티리얼즈("㈜포스코MC머티리얼즈",127.7727712,34.91374408),
    포스코광양("㈜포스코 광양제철소",127.7360602,34.93238912),
    포스코엠텍제2공장("㈜포스코엠텍 제2공장",129.3853847,35.97535866),
    포스코스틸리온도금공장("포스코스틸리온㈜도금공장",129.3643902,35.98985475),
    포스코스틸리온컬러공장("포스코스틸리온㈜컬러공장",129.375232138907,36.00070656),
    공장1("현대제철㈜", 126.731535885128, 36.9864619107465),
    공장2("현대제철㈜포항2공장", 129.37029436333, 35.9761502690989),
    공장3("현대제철㈜포항1공장", 129.374109577448, 36.005693531948),
    공장4("현대제철㈜순천공장", 127.581404873639, 34.9171427265179),
    공장5("현대제철㈜ 인천공장", 126.642055586008, 37.4849244136151),
    공장6("에스케이하이닉스(주)이천스마트에너지센터", 127.480685306373, 37.2529797635041),
    공장7("에스케이하이닉스㈜", 127.480685306373, 37.2529797635041),
    공장8("SK에너지㈜하이닉스 이천지점", 127.480685306373, 37.2529797635041),
    공장9("에스케이하이닉스㈜ 청주4공장", 127.430504943472, 36.6554264473725),
    공장10("에스케이하이닉스㈜ 청주3공장", 127.42999350729, 36.646256703321),
    공장11("에스케이하이닉스㈜ 청주1공장", 127.434583164692, 36.6528667637297),
    공장12("엘지디스플레이㈜", 126.756818111533, 37.8158852217591),
    공장13("㈜엘지화학 청주공장", 127.436514715389, 36.6525109645629),
    공장14("㈜엘지화학 나주공장", 126.719559410924, 35.025880277203),
    공장15("㈜엘지화학 대산공장", 126.38078775781, 37.0071000377087),
    공장16("(주)엘지화학 여수공장(용성1단지)", 127.685723535703, 34.8334567680939),
    공장17("㈜엘지화학(여수공장-화치)", 127.651084011153, 34.8008542512203),
    공장18("㈜엘지에너지솔루션 오창에너지플랜트2", 127.447945919299, 36.731677171215),
    공장19("(주)엘지화학 여수공장(용성2단지)", 127.685341541733, 34.8412620308493),
    공장20("삼성전자㈜구미2사업장", 128.415801893962, 36.1096007356246),
    공장21("삼성전자㈜기흥사업장", 127.087763746841, 37.2269444725375),
    공장22("삼성디스플레이㈜", 127.065465882945, 36.8116465879469),
    공장23("삼성전자㈜SAIT_종합기술원(구)", 127.057817491283, 37.2509391672754),
    공장24("삼성디스플레이(주)아산2", 127.063361951565, 36.8191879482132),
    공장25("삼성전기㈜", 127.058691198576, 37.2652337837866),
    공장26("삼성전자㈜화성사업장", 127.06332933084, 37.2234719215655),
    공장27("삼성전기㈜부산공장", 128.857751633716, 35.0961029679051),
    공장29("삼성디스플레이㈜", 127.087763746841, 37.2269444725375),
    공장30("삼성전자㈜수원사업장", 127.053129481167, 37.257643055151),
    공장31("삼성서울병원", 127.089590154403, 37.49034450782),
    공장32("삼성전기㈜", 127.334292714623, 36.5406489816549),
    공장33("삼성바이오로직스㈜", 126.660256251447, 37.3683817353105);


    private final String code;
    private final double latitude;
    private final double longitude;

    Address(String code, double latitude, double longitude) {
        this.code = code;
        this.latitude = latitude;
        this.longitude = longitude;
    }

    public String getCode() {
        return code;
    }

    public double getLatitude() {
        return latitude;
    }

    public double getLongitude() {
        return longitude;
    }

    @Override
    public String toString() {
        return "(" +
                "\"" + code + '\"' +
                ", " + latitude +
                ", " + longitude +
                ')';
    }
}
