package pkg;

public enum City {
    가산디지털단지역("POI013",37.481072,	126.882343),
    강남역("POI014",37.497175,127.027926),
    건대입구역("POI015",37.540693,	127.07023),
    고덕역("POI016",37.555004,127.154151),
    고속터미널역("POI017",	37.50481,	127.004943),
    교대역("POI018",37.493415,	127.01408),
    구로디지털단지역("POI019",37.485266	,126.901401),
    구로역("POI020",37.503039,126.881966),
    군자역("POI021",37.557121,127.079542),
    남구로역("POI022",37.486056,126.887249),
    대림역("POI023",37.49297,126.895801),
    동대문역("POI024",37.57142,127.009745),
    뚝섬역("POI025",37.547184,127.047367),
    미아사거리역("POI026",37.613292,127.030053),
    발산역("POI027",37.558598,126.837668),
    북한산우이역("POI028",37.663146,127.012789),
    사당역("POI029",37.47653,126.981685),
    삼각지역("POI030",37.534777,126.97311),
    서울대입구역("POI031",37.481247,126.952739),
    마곡나루역("POI032",37.567336,126.829497),
    서울역("POI033",37.554648,126.972559),
    선릉역("POI034",37.504503,127.049008),
    성신여대입구역("POI035",37.592624,127.016403),
    수유역("POI036",37.638052,127.025732),
    논현역("POI037",37.511093,127.021415),
    신도림역("POI038",37.508725,126.891295
    ),
    회기역("POI056",37.58946,127.057583),
    홍대입구역("POI055",37.557192,126.925381),
    혜화역("POI054",37.582336,127.001844),
    합정역("POI053",37.549463,126.913739),
    충정로역("POI052",37.559973,126.963672),
    총신대입구역("POI051",37.486263,126.981989),
    천호역("POI050",37.538397,127.123572),
    장한평역("POI049",37.56144,127.064623),
    장지역("POI048",37.478703,127.126191),
    이태원역("POI047",37.534488,126.994302),
    용산역("POI046",37.529849,126.964561),
    왕십리역("POI045",37.561533,127.037732),
    오목교역("POI044",37.524496,126.875181),
    연신내역("POI043",37.619001,126.921008),
    역삼역("POI042",37.500622,127.036456),
    양재역("POI041",37.484147,127.034631),
    신촌역("POI040",37.555134,126.936893),
    신림역("POI039",37.484201,126.929715);



    private final String code;
    private final double latitude;
    private final double longitude;

    City(String code, double latitude, double longitude) {
        this.code = code;
        this.latitude = latitude;
        this.longitude = longitude;
    }

    public String getCode() {
        return code;
    }

    public double getLatitude() {
        return latitude;
    }

    public double getLongitude() {
        return longitude;
    }
}
